# Análise exploratória

In [961]:
# Importando as bibliotecas

import pandas as pd
import matplotlib.pyplot as plt

#### Leitura :

In [962]:
# Leitura de Dados 

# Atribuindo a uma variável a localização do arquivo
df = pd.read_csv('./titanic.csv',sep=',') # Lendo Arquivo CSV
type(df) # Verificando o tipo da variavel criada, confirmando de fato se é um DataFrame

pandas.core.frame.DataFrame

#### Visualização :

In [963]:
# Visualização de Dados

display(df) # Exibição de todos os dados do DataFrame
df.info() # Informações sobre o DataFrame
df.describe() # Estatistica do DataFrame
df.shape # Total de linhas e colunas respectivamente

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

(891, 12)

#### Tratamento :

In [964]:
# Limpando os valores nulos 

df[['Cabin']] = df[['Cabin']].fillna('Não Encontrado(a)') # Definindo valor 'Não Encontrado(a)' a coluna Cabin
df[['Age']] = df[['Age']].fillna(0) # Definindo valor 0 a coluna Age
display(df) # Verificando nvamente o DataFrame

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,Não Encontrado(a),S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,Não Encontrado(a),S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,Não Encontrado(a),S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,Não Encontrado(a),S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0.0,1,2,W./C. 6607,23.4500,Não Encontrado(a),S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Não Encontrado(a),Q

##### Novo DataFrame

In [965]:
# Filtrando as colunas de interesse

new_df = df[['Survived','Pclass','Sex','Age']] # Atribuindo as colunas para um novo DataFrame 
display(new_df) # Visualizando no novo DataFrame
type(new_df) # Confirmando o tipo

     Survived  Pclass     Sex   Age
0           0       3    male  22.0
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
4           0       3    male  35.0
..        ...     ...     ...   ...
886         0       2    male  27.0
887         1       1  female  19.0
888         0       3  female   0.0
889         1       1    male  26.0
890         0       3    male  32.0

[891 rows x 4 columns]

pandas.core.frame.DataFrame

#### Agrupamento e Refurmulação

Tenho que pegar a quantidade de sobreviventes de homens e mulheres colocar em uma coluna

In [966]:
# Filtrando novamente as colunas importante
survived_df = new_df[['Survived', 'Sex']] # Atribuindo as colunas para um novo DataFrame
data_grouped = survived_df.groupby(['Survived', 'Sex']).size().reset_index(name='Value') # Agrupando as colunas
data_grouped = data_grouped.pivot(index='Sex',columns='Survived',values='Value') # Reformulando do novo DataFrame
data_grouped.columns.name = None 
data_grouped.rename(columns={0:'Not-Survived',1:'Survived'},inplace=True) # Renomeando as novas Colunas
display(data_grouped) # Exibindo no novo DataFrame

        Not-Survived  Survived
Sex
female            81       233
male             468       109

#### Gráficos :

##### Grafico 1 | Sobreviventes por Sexo

##### Grafico | a